TexasInstruments/f29h85x-sdk/source/driverlib/esm.h
//###########################################################################
//
// FILE:   esm.h
//
// TITLE:  C29x Error Signalling Module (ESM) driver.
//
//###########################################################################
// //
//	Copyright: Copyright (C) Texas Instruments Incorporated
//	All rights reserved not granted herein.
//
//  Redistribution and use in source and binary forms, with or without 
//  modification, are permitted provided that the following conditions 
//  are met:
//
//  Redistributions of source code must retain the above copyright 
//  notice, this list of conditions and the following disclaimer.
//
//  Redistributions in binary form must reproduce the above copyright
//  notice, this list of conditions and the following disclaimer in the 
//  documentation and/or other materials provided with the   
//  distribution.
//
//  Neither the name of Texas Instruments Incorporated nor the names of
//  its contributors may be used to endorse or promote products derived
//  from this software without specific prior written permission.
//
//  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
//  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
//  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
//  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
//  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
//  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
//  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
//  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
//  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
//  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
//  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
//

//###########################################################################

#ifndef ESM_H
#define ESM_H

//*****************************************************************************
//
// If building with a C++ compiler, make all of the definitions in this header
// have a C binding.
//
//*****************************************************************************
#ifdef __cplusplus
extern "C"
{
#endif

//*****************************************************************************
//
//! \addtogroup esm_api ESM
//! \brief This module is used for ESM configurations.
//! @{
//
//*****************************************************************************

#include <stdbool.h>
#include <stdint.h>
#include "inc/hw_memmap.h"
#include "inc/hw_sysctl.h"
#include "inc/hw_types.h"
#include "inc/hw_esm_cpu.h"
#include "inc/hw_esm_sys.h"
#include "inc/hw_esm_safety_aggregator.h"
#include "cpu.h"
#include "debug.h"


//*****************************************************************************
//
// Values that are used in ESM_enableGlobal() and ESM_disableGlobal()
//
//*****************************************************************************
#define ESM_GLOBAL_ENABLE        0xFU
#define ESM_GLOBAL_DISABLE       0x0U

//*****************************************************************************
//
// Values that are used in ESM_enableHighPriorityWatchdog()
//
//*****************************************************************************
#define ESM_WATCHDOG_ENABLE     0xAU
#define ESM_WATCHDOG_DISABLE    0x0U

//*****************************************************************************
//
// Values that are used in ESM_enableErrorPinMonitor()
//
//*****************************************************************************
#define ESM_ERROR_PIN_MONITOR_ENABLE     0xAU
#define ESM_ERROR_PIN_MONITOR_DISABLE    0x0U

//*****************************************************************************
//
//! Values that are used in ESM_lockMMRConfig(), ESM_unlockMMRConfig() and
//! ESM_commitMMRConfig()
//
//*****************************************************************************
#define ESM_GLOBAL_EN_REG              ESM_CPU_MMR_CONFIG_LOCK_GLOBEL_EN_LOCK
#define ESM_GLOBAL_SOFT_RESET_REG ESM_CPU_MMR_CONFIG_LOCK_GLOBAL_SOFT_RST_LOCK
#define ESM_ERROR_PIN_REG              ESM_CPU_MMR_CONFIG_LOCK_ERRPIN_LOCK
#define ESM_ERROR_PIN_MONITOR_REG      ESM_CPU_MMR_CONFIG_LOCK_ERRPIN_MON_LOCK
#define ESM_HIGH_PRIORITY_WATCHDOG_REG ESM_CPU_MMR_CONFIG_LOCK_HI_PRI_WD_LOCK

//*****************************************************************************
//
//! The number of groups in ESM
//
//*****************************************************************************
#define ESM_NUM_GROUPS                  8U

//*****************************************************************************
//
//! Values that can be used to specify the ESM error event.
//
//*****************************************************************************
typedef enum
{
	ESM_EVENT_ErrorAggregator_CPU1_HPERR           = 0,
	ESM_EVENT_ErrorAggregator_CPU2_HPERR           = 1,
	ESM_EVENT_ErrorAggregator_CPU3_HPERR           = 2,
	ESM_EVENT_ErrorAggregator_CPU1_INT_HPERR       = 3,
	ESM_EVENT_ErrorAggregator_CPU2_INT_HPERR       = 4,
	ESM_EVENT_ErrorAggregator_CPU3_INT_HPERR       = 5,
	ESM_EVENT_CLOCKFAIL                            = 32,
	ESM_EVENT_DCC1_ERR                             = 33,
	ESM_EVENT_DCC2_ERR                             = 34,
	ESM_EVENT_DCC3_ERR                             = 35,
	ESM_EVENT_CPU1RSn                              = 37,
	ESM_EVENT_CPU1WD                               = 38,
	ESM_EVENT_CPU1_ERAD_INT                        = 39,
	ESM_EVENT_CPU1_ERAD_NMI                        = 40,
	ESM_EVENT_ESM_CPU1_LOW_PRIORITY_INT            = 41,
	ESM_EVENT_ESM_CPU1_HIGH_PRIORITY_INT           = 42,
	ESM_EVENT_LCM_CPU1SS_LCMPERR                   = 43,
	ESM_EVENT_CPU2RSn                              = 44,
	ESM_EVENT_CPU2WD                               = 45,
	ESM_EVENT_CPU2_ERAD_INT                        = 46,
	ESM_EVENT_CPU2_ERAD_NMI                        = 47,
	ESM_EVENT_ESM_CPU2_LOW_PRIORITY_INT            = 48,
	ESM_EVENT_ESM_CPU2_HIGH_PRIORITY_INT           = 49,
	ESM_EVENT_CPU3RSn                              = 50,
	ESM_EVENT_CPU3WD                               = 51,
	ESM_EVENT_CPU3_ERAD_INT                        = 52,
	ESM_EVENT_CPU3_ERAD_NMI                        = 53,
	ESM_EVENT_ESM_CPU3_LOW_PRIORITY_INT            = 54,
	ESM_EVENT_ESM_CPU3_HIGH_PRIORITY_INT           = 55,
	ESM_EVENT_RTDMA_LCM_CMP_ERR                    = 56,
	ESM_EVENT_ESM_ERRPIN_MON_EVT                   = 58,
	ESM_EVENT_ESM_PARITY_ERROR                     = 59,
	ESM_EVENT_HSM_HEA_INT_LO                       = 63,
	ESM_EVENT_HSM_HEA_INT_HI                       = 64,
	ESM_EVENT_INPUTXBAR63                          = 65,
	ESM_EVENT_INPUTXBAR64                          = 66,
	ESM_EVENT_EPWMXBAR1                            = 67,
	ESM_EVENT_EPWMXBAR2                            = 68,
	ESM_EVENT_EPWMXBAR3                            = 69,
	ESM_EVENT_EPWMXBAR4                            = 70,
	ESM_EVENT_EPWMXBAR5                            = 71,
	ESM_EVENT_EPWMXBAR6                            = 72,
	ESM_EVENT_EPWMXBAR7                            = 73,
	ESM_EVENT_EPWMXBAR8                            = 74,
	ESM_EVENT_EPWMXBAR9                            = 75,
	ESM_EVENT_EPWMXBAR10                           = 76,
	ESM_EVENT_EPWMXBAR11                           = 77,
	ESM_EVENT_EPWMXBAR12                           = 78,
	ESM_EVENT_EPWMXBAR13                           = 79,
	ESM_EVENT_EPWMXBAR14                           = 80,
	ESM_EVENT_EPWMXBAR15                           = 81,
	ESM_EVENT_EPWMXBAR16                           = 82,
	ESM_EVENT_OUTPUTXBAR1                          = 83,
	ESM_EVENT_OUTPUTXBAR2                          = 84,
	ESM_EVENT_OUTPUTXBAR3                          = 85,
	ESM_EVENT_OUTPUTXBAR4                          = 86,
	ESM_EVENT_OUTPUTXBAR5                          = 87,
	ESM_EVENT_OUTPUTXBAR6                          = 88,
	ESM_EVENT_OUTPUTXBAR7                          = 89,
	ESM_EVENT_OUTPUTXBAR8                          = 90,
	ESM_EVENT_OUTPUTXBAR9                          = 91,
	ESM_EVENT_OUTPUTXBAR10                         = 92,
	ESM_EVENT_OUTPUTXBAR11                         = 93,
	ESM_EVENT_OUTPUTXBAR12                         = 94,
	ESM_EVENT_OUTPUTXBAR13                         = 95,
	ESM_EVENT_OUTPUTXBAR14                         = 96,
	ESM_EVENT_OUTPUTXBAR15                         = 97,
	ESM_EVENT_OUTPUTXBAR16                         = 98,
	ESM_EVENT_WADI1_INTN_O                         = 99,
	ESM_EVENT_WADI2_INTN_O                         = 100,
	ESM_EVENT_CLB1_NMI                             = 102,
	ESM_EVENT_CLB2_NMI                             = 103,
	ESM_EVENT_CLB3_NMI                             = 104,
	ESM_EVENT_CLB4_NMI                             = 105,
	ESM_EVENT_CLB5_NMI                             = 106,
	ESM_EVENT_CLB6_NMI                             = 107,
	ESM_EVENT_EPG_INT                              = 108,
	ESM_EVENT_ECAT_NMIn                            = 109,
	ESM_EVENT_MCANA_ECC_CORR_PLS                   = 110,
	ESM_EVENT_MCANA_ECC_UNCORR_TS_PLS              = 111,
	ESM_EVENT_MCANB_ECC_CORR_PLS                   = 112,
	ESM_EVENT_MCANB_ECC_UNCORR_TS_PLS              = 113,
	ESM_EVENT_MCANC_ECC_CORR_PLS                   = 114,
	ESM_EVENT_MCANC_ECC_UNCORR_TS_PLS              = 115,
	ESM_EVENT_MCAND_ECC_CORR_PLS                   = 116,
	ESM_EVENT_MCAND_ECC_UNCORR_TS_PLS              = 117,
	ESM_EVENT_MCANE_ECC_CORR_PLS                   = 118,
	ESM_EVENT_MCANE_ECC_UNCORR_TS_PLS              = 119,
	ESM_EVENT_MCANF_ECC_CORR_PLS                   = 120,
	ESM_EVENT_MCANF_ECC_UNCORR_TS_PLS              = 121,
	ESM_EVENT_EMIF1_ERR                            = 122,
	ESM_EVENT_ADC_SAFETY_CHECK_INT_CPU1            = 123,
	ESM_EVENT_ADC_SAFETY_CHECK_INT_CPU2            = 124,
	ESM_EVENT_ADC_SAFETY_CHECK_INT_CPU3            = 125,
	ESM_EVENT_ErrorAggregator_CPU1_LPERR           = 128,
	ESM_EVENT_ErrorAggregator_CPU2_LPERR           = 130,
	ESM_EVENT_ErrorAggregator_CPU3_LPERR           = 132,
	ESM_EVENT_ErrorAggregator_CPU1_INT_LPERR       = 134,
	ESM_EVENT_ErrorAggregator_CPU2_INT_LPERR       = 136,
	ESM_EVENT_ErrorAggregator_CPU3_INT_LPERR       = 138,
	ESM_EVENT_ErrorAggregator_RTDMA1_HPERR         = 139,
	ESM_EVENT_ErrorAggregator_RTDMA1_LPERR         = 140,
	ESM_EVENT_ErrorAggregator_RTDMA2_HPERR         = 141,
	ESM_EVENT_ErrorAggregator_RTDMA2_LPERR         = 142,
	ESM_EVENT_ErrorAggregator_SSU_HPERR            = 143,
	ESM_EVENT_ErrorAggregator_ECAT_MEM_HPERR       = 146,
	ESM_EVENT_ErrorAggregator_ECAT_MEM_LPERR       = 147,
	ESM_EVENT_MCANA_FEVT0                          = 162,
	ESM_EVENT_MCANA_FEVT1                          = 163,
	ESM_EVENT_MCANA_FEVT2                          = 164,
	ESM_EVENT_MCANB_FEVT0                          = 165,
	ESM_EVENT_MCANB_FEVT1                          = 166,
	ESM_EVENT_MCANB_FEVT2                          = 167,
	ESM_EVENT_MCANC_FEVT0                          = 168,
	ESM_EVENT_MCANC_FEVT1                          = 169,
	ESM_EVENT_MCANC_FEVT2                          = 170,
	ESM_EVENT_MCAND_FEVT0                          = 171,
	ESM_EVENT_MCAND_FEVT1                          = 172,
	ESM_EVENT_MCAND_FEVT2                          = 173,
	ESM_EVENT_MCANE_FEVT0                          = 174,
	ESM_EVENT_MCANE_FEVT1                          = 175,
	ESM_EVENT_MCANE_FEVT2                          = 176,
	ESM_EVENT_MCANF_FEVT0                          = 177,
	ESM_EVENT_MCANF_FEVT1                          = 178,
	ESM_EVENT_MCANF_FEVT2                          = 179,
	ESM_EVENT_WADI1_BLOCK1_SIG1ERROR_BUS_O_0       = 180,
	ESM_EVENT_WADI1_BLOCK1_SIG2ERROR_BUS_O_1       = 181,
	ESM_EVENT_WADI1_BLOCK1_SIG_TO_SIGERROR_BUS_O_2 = 182,
	ESM_EVENT_WADI1_BLOCK2_SIG1ERROR_BUS_O_0       = 183,
	ESM_EVENT_WADI1_BLOCK2_SIG2ERROR_BUS_O_1       = 184,
	ESM_EVENT_WADI1_BLOCK2_SIG_TO_SIGERROR_BUS_O_2 = 185,
	ESM_EVENT_WADI1_BLOCK3_SIG1ERROR_BUS_O_0       = 186,
	ESM_EVENT_WADI1_BLOCK3_SIG2ERROR_BUS_O_1       = 187,
	ESM_EVENT_WADI1_BLOCK3_SIG_TO_SIGERROR_BUS_O_2 = 188,
	ESM_EVENT_WADI1_BLOCK4_SIG1ERROR_BUS_O_0       = 189,
	ESM_EVENT_WADI1_BLOCK4_SIG2ERROR_BUS_O_1       = 190,
	ESM_EVENT_WADI1_BLOCK4_SIG_TO_SIGERROR_BUS_O_2 = 191,
	ESM_EVENT_WADI2_BLOCK1_SIG1ERROR_BUS_O_0       = 192,
	ESM_EVENT_WADI2_BLOCK1_SIG2ERROR_BUS_O_1       = 193,
	ESM_EVENT_WADI2_BLOCK1_SIG_TO_SIGERROR_BUS_O_2 = 194,
	ESM_EVENT_WADI2_BLOCK2_SIG1ERROR_BUS_O_0       = 195,
	ESM_EVENT_WADI2_BLOCK2_SIG2ERROR_BUS_O_1       = 196,
	ESM_EVENT_WADI2_BLOCK2_SIG_TO_SIGERROR_BUS_O_2 = 197,
	ESM_EVENT_WADI2_BLOCK3_SIG1ERROR_BUS_O_0       = 198,
	ESM_EVENT_WADI2_BLOCK3_SIG2ERROR_BUS_O_1       = 199,
	ESM_EVENT_WADI2_BLOCK3_SIG_TO_SIGERROR_BUS_O_2 = 200,
	ESM_EVENT_WADI2_BLOCK4_SIG1ERROR_BUS_O_0       = 201,
	ESM_EVENT_WADI2_BLOCK4_SIG2ERROR_BUS_O_1       = 202,
	ESM_EVENT_WADI2_BLOCK4_SIG_TO_SIGERROR_BUS_O_2 = 203,
	ESM_EVENT_EQEPERR                              = 233,
	ESM_EVENT_C29CPU1_FLOATINGPOINT_OVERFLOW_INT   = 235,
	ESM_EVENT_C29CPU1_FLOATINGPOINT_UNDERFLOW_INT  = 236,
	ESM_EVENT_C29CPU1_FIXEDPOINT_OVERFLOW_INT      = 237,
	ESM_EVENT_C29CPU2_FLOATINGPOINT_OVERFLOW_INT   = 238,
	ESM_EVENT_C29CPU2_FLOATINGPOINT_UNDERFLOW_INT  = 239,
	ESM_EVENT_C29CPU2_FIXEDPOINT_OVERFLOW_INT      = 240,
	ESM_EVENT_C29CPU3_FLOATINGPOINT_OVERFLOW_INT   = 241,
	ESM_EVENT_C29CPU3_FLOATINGPOINT_UNDERFLOW_INT  = 242,
	ESM_EVENT_C29CPU3_FIXEDPOINT_OVERFLOW_INT      = 243,
	ESM_EVENT_MEMSS_REG_PAR_ERR                    = 244,
	ESM_EVENT_FRI_REG_PAR_ERR                      = 245,
	ESM_EVENT_SYSCTL_OR_ANALOGSYSCTL_REG_PAR_ERR   = 246,
	ESM_EVENT_LCM_CPU1SS_REG_PAR_ERR               = 247,
	ESM_EVENT_LCM_RTDMA_REG_PAR_ERR                = 248,
	ESM_EVENT_WADI_REG_PAR_ERR                     = 249,
	ESM_EVENT_CPU1_TMUROM_PAR_ERR                  = 250,
	ESM_EVENT_CPU2_TMUROM_PAR_ERR                  = 251,
	ESM_EVENT_CPU3_TMUROM_PAR_ERR                  = 252
} ESM_EventMap;


//*****************************************************************************
//
//! Values that can be returned by ESM_getLastResetSource as the reset source.
//
//*****************************************************************************
typedef enum
{
    ESM_RESET_SOURCE_POR        = 0x0U,  //! Last reset was a Power On Reset
    ESM_RESET_SOURCE_WARM_RESET = 0x1U,  //! Last reset was a Warm Reset
}ESM_ResetSource;

//*****************************************************************************
//
//! Values that can be passed to ESM_writeEOIVector() as the \e vector
//! parameter.
//
//*****************************************************************************
typedef enum
{
    ESM_EOI_CONFIG_ERROR_INTERRUPT            = 0x0U,
    ESM_EOI_LOW_PRIORITY_ERROR_INTERRUPT      = 0x1U,
    ESM_EOI_HIGH_PRIORITY_ERROR_INTERRUPT     = 0x2U,
    ESM_EOI_HIGH_PRIORITY_WATCHDOG_INTERRUPT  = 0x4U,
    ESM_EOI_ERROR_PIN_MONITOR_INTERRUPT       = 0x5U,
}ESM_EOIVector;

//*****************************************************************************
//
//! Values that can be passed to ESM_ackInterrupt() as the \e vector
//! parameter.
//
//*****************************************************************************
typedef enum
{
    ESM_CONFIG_ERROR_INTERRUPT            = 0x0U,
    ESM_LOW_PRIORITY_ERROR_INTERRUPT      = 0x1U,
    ESM_HIGH_PRIORITY_ERROR_INTERRUPT     = 0x2U,
    ESM_HIGH_PRIORITY_WATCHDOG_INTERRUPT  = 0x4U,
    ESM_ERROR_PIN_MONITOR_INTERRUPT       = 0x5U,
}ESM_InterruptType;

//*****************************************************************************
//
//! Values that can be passed to ESM_setOutputPinMode() as the \e mode
//! parameter.
//
//*****************************************************************************
typedef enum
{
    ESM_OUTPUT_LEVEL_MODE = 0x0U,  //! Level mode
    ESM_OUTPUT_PWM_MODE = 0xFU,    //! PWM mode
} ESM_OutputPinMode;

//*****************************************************************************
//
//! Values that can be passed to ESM_setErrorMode() as the \e mode parameter.
//
//*****************************************************************************
typedef enum
{
    //! ESM Normal mode of operation
    ESM_NORMAL_MODE = 0U,
    //! ESM Error force mode of operation
    ESM_ERROR_FORCE_MODE = 0xAU,
    //! Clear event (returns to Normal Mode (4’b0000) on the next cycle.)
    ESM_CLEAR_EVENT = 0x5U
} ESM_OperationMode;

//*****************************************************************************
//
//! Values that can be passed to ESM_setLevelModePolarity() as the \e polarity
//! parameter.
//
//*****************************************************************************
typedef enum
{
    //! The error output pin in level mode is active low (default).
    ESM_LEVEL_POLARITY_ACTIVE_LOW = 0x0U,
    //! The polarity of error output pin is active high.
    ESM_LEVEL_POLARITY_ACTIVE_HIGH = 0xFU
}ESM_LevelModePolarity;

//*****************************************************************************
//
//! Values that can be passed to ESM_setInterruptPriorityLevel() as the
//! \e priority parameter.
//
//*****************************************************************************
typedef enum
{
    //! Configure interrupt priority level to low priority
    ESM_INTERRUPT_PRIORITY_LEVEL_LOW = 0x0U,
    //! Configure interrupt priority level to high priority
    ESM_INTERRUPT_PRIORITY_LEVEL_HIGH = 0x1U
}ESM_InterruptPriorityLevel;

//*****************************************************************************
//
//! Values that can be passed to ESM_getLowPriorityInterruptStatus() and
//! ESM_getHighPriorityInterruptStatus() as the \e group parameter.
//
//*****************************************************************************
typedef enum
{
    ESM_EVENT_GROUP_1 = 0x1U,
    ESM_EVENT_GROUP_2 = 0x2U,
    ESM_EVENT_GROUP_3 = 0x4U,
    ESM_EVENT_GROUP_4 = 0x8U,
    ESM_EVENT_GROUP_5 = 0x10U,
    ESM_EVENT_GROUP_6 = 0x20U,
    ESM_EVENT_GROUP_7 = 0x40U,
    ESM_EVENT_GROUP_8 = 0x80U,
}ESM_EventGroup;

//*****************************************************************************
//
//! Values that can be passed to ESM_config().
//
//*****************************************************************************
typedef enum
{
    //! Configure low priority interrupt
    ESM_CONFIG_LOW_PRIORITY_INTERRUPT      = 0x0U,
    //! Configure NMI
    ESM_CONFIG_NMI                         = 0x1U,
    //! Configure Critical priority interrupt
    ESM_CONFIG_CRITICAL_PRIORITY_INTERRUPT = 0x2U,
    //! Configure Error Pin output
    ESM_CONFIG_ERROR_PIN                   = 0x3U
}ESM_ConfigType;

//*****************************************************************************
//
//! Values that can be passed to Safety Aggregator APIs as ESM instance
//! parameter.
//
//*****************************************************************************
typedef enum
{
    ESM_INSTANCE_SYS_ESM = 0x1U,
    ESM_INSTANCE_ESM1    = 0x2U,
    ESM_INSTANCE_ESM2    = 0x4U,
    ESM_INSTANCE_ESM3    = 0x8U
}ESM_Instance;

//*****************************************************************************
//
//! Values that are used in ESM_enableAggrErrorInterrupt(),
//! ESM_disableAggrErrorInterrupt(), ESM_forceAggrErrorInterrupt(),
//! ESM_getAggrErrorInterruptStatus() and ESM_clearAggrErrorInterruptStatus()
//! as the errorType parameter.
//
//*****************************************************************************
typedef enum
{
    ESM_AGGR_PARITY_ERROR,
    ESM_AGGR_TIMEOUT_ERROR
}ESM_AggrErrorType;


//*****************************************************************************
//
//! Values that can be passed to ESM_configErrorEvent() as the configure
//! parameter.
//
//*****************************************************************************
typedef struct
{
    //! Global event number of the error event.
    uint32_t                     event;
    //! Enable interrupt.
    bool                         enableInterrupt;
    //! Set the interrupt priority level to high or low.
    ESM_InterruptPriorityLevel   interruptPriorityLevel;
    //! Enable influence on critical priority interrupt.
    bool                         enableCriticalPriorityInterruptInfluence;
    //! Enable failure influence on ERROR pin.
    bool                         enableInfluenceOnErrorPin;
} ESM_ConfigParams;

//*****************************************************************************
//
//! Values that can be passed to ESM_configErrorPin() as the configure
//! parameter.
//
//*****************************************************************************
typedef struct
{
    //! Operation mode of Error Pin.
    ESM_OperationMode              mode;
    //! Error pin output mode.
    ESM_OutputPinMode              pinMode;
    //! Polarity of the error pin in Level mode.
    ESM_LevelModePolarity          polarity;
    //! Enable error pin monitor.
    bool                           enableErrorPinMonitor;
}ESM_ErrorPinConfigParams;

//*****************************************************************************
//
// Prototypes for the APIs.
//
//*****************************************************************************
//*****************************************************************************
//
//! \internal
//! Checks an ESM module base address.
//!
//! \param base specifies the ESM base address.
//!
//! This function determines if a ESM address is valid.
//!
//! \return Returns \b true if the base address is valid and \b false
//! otherwise.
//
//*****************************************************************************
#ifdef DEBUG
static inline bool
ESM_isBaseValid(uint32_t base)
{
    return(
           ((base & BASE_ADDR_MASK) == ESMCPU1_BASE_FRAME(0U)) ||
           ((base & BASE_ADDR_MASK) == ESMCPU2_BASE_FRAME(0U)) ||
           ((base & BASE_ADDR_MASK) == ESMCPU3_BASE_FRAME(0U)) ||
           ((base & BASE_ADDR_MASK) == ESMSYSTEM_BASE_FRAME(0U)) ||
           ((base & BASE_ADDR_MASK) == ESMSAFETYAGG_BASE_FRAME(0U))
          );
}
#endif

//*****************************************************************************
//
//! ESM Global Soft Reset
//!
//! \param base is the base address of the ESM instance.
//!
//! This function does a Global Soft Reset to reset all enables and raw
//! status bits
//!
//! \return None.
//
//*****************************************************************************
static inline void
ESM_triggerSoftReset(uint32_t base)
{
    //
    // Check the arguments
    //
    ASSERT(ESM_isBaseValid(base));

    //
    // Set the soft reset bits.
    //
    HWREGB(base + ESM_CPU_O_SFT_RST) = 0xFU;
}

//*****************************************************************************
//
//! Get last Reset source
//!
//! \param base is the base address of the ESM instance.
//!
//! This function returns the Source of the last Reset.
//!
//! \return None.
//
//*****************************************************************************
static inline ESM_ResetSource
ESM_getLastResetSource(uint32_t base)
{
    //
    // Check the arguments
    //
    ASSERT(ESM_isBaseValid(base));

    //
    // Set the soft reset bits.
    //
    return((ESM_ResetSource)((HWREG(base + ESM_CPU_O_INFO) &
                     ESM_CPU_INFO_LAST_RESET) == ESM_CPU_INFO_LAST_RESET));
}

//*****************************************************************************
//
//! Enable all interrupts (Global enable).
//!
//! \param base is the base address of the ESM module instance.
//!
//! The function enables all the interrupts.
//!
//! \return None.
//
//*****************************************************************************
static inline void
ESM_enableGlobal(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(ESM_isBaseValid(base));

    //
    // Global enable.
    //
    HWREGB(base + ESM_CPU_O_EN) = ESM_GLOBAL_ENABLE;
}

