TexasInstruments/f29h85x-sdk/source/driverlib/esm.h
//*****************************************************************************
//
//! Disables all the interrupts.
//!
//! \param base is the base address of the ESM instance.
//!
//! This function disables all the interrupts (Global disable)
//!
//! \return None.
//
//*****************************************************************************
static inline void
ESM_disableGlobal(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(ESM_isBaseValid(base));

    //
    // Disable all interrupts
    //
    HWREGB(base + ESM_CPU_O_EN) = ESM_GLOBAL_DISABLE;
}

//*****************************************************************************
//
//! Write the EOI vector to the EOI register.
//!
//! \param base is the base address of the ESM configuration registers.
//! \param vector is the corresponding vector for the interrupt.
//!             Refer ESM_EOIVector enum
//!
//! This function writes the corresponding EOI vector to the EOI register.
//! Writing the vector to this field will cause a re-evaluation of interrupts.
//! If, when the vector is written, there are still pending interrupts, a new
//! pulse will be generated.
//!
//! \return None.
//
//*****************************************************************************
static inline void
ESM_writeEOIVector(uint32_t base, ESM_EOIVector vector)
{
    //
    // Check the arguments.
    //
    ASSERT(ESM_isBaseValid(base));

    //
    // Write the vector to the EOI register.
    //
    HWREGH(base + ESM_CPU_O_EOI) = (uint16_t)vector;
}

//*****************************************************************************
//
//! Write the EOI vector to acknowledge the interrupt.
//!
//! \param base is the base address of the ESM configuration registers.
//! \param interruptType is the type of interrupt mapping the EOI vector.
//!             Refer ESM_InterruptType enum
//!
//! This function writes the corresponding EOI vector to the EOI register
//! based on the interrupt type passes.
//! Writing the vector to this field will cause a re-evaluation of interrupts.
//! If, when the vector is written, there are still pending interrupts, a new
//! pulse will be generated.
//!
//! \return None.
//
//*****************************************************************************
static inline void
ESM_ackInterrupt(uint32_t base, ESM_InterruptType interruptType)
{
    //
    // Check the arguments.
    //
    ASSERT(ESM_isBaseValid(base));

    //
    // Write the EOI vector to the EOI register based on the interrupt type.
    //
    HWREGH(base + ESM_CPU_O_EOI) = (uint16_t)interruptType;
}

//*****************************************************************************
//
//! Configure the operation mode of Error pin.
//!
//! \param mode is the Error pin mode to be configured.
//!             Refer ESM_OperationMode enum
//!
//! This function sets the mode of the Error pin of the ESM.
//!
//! \return None.
//
//*****************************************************************************
static inline void
ESM_setErrorMode(ESM_OperationMode mode)
{
    //
    // Configure the operation mode.
    //
    HWREGB(ESMSYSTEM_BASE + ESM_SYS_O_PIN_CTRL) =
                                (HWREGB(ESMSYSTEM_BASE + ESM_SYS_O_PIN_CTRL) &
                                ~(ESM_SYS_PIN_CTRL_KEY_M)) |
                                ((uint8_t)mode << ESM_SYS_PIN_CTRL_KEY_S);
}


//*****************************************************************************
//
//! Clears the Error pin
//!
//! The clear event mode from ESM_OperationMode enum is used.
//!
//! This function clears the Error pin. For the Error pin to de-assert,
//! 1.The Minimum Time Interval must expire
//! 2.The event that caused the Error Pin to assert must be cleared
//! 3.A CLEAR must be written to the Error Pin Control Register using this
//! function
//!
//! \return None.
//
//*****************************************************************************
static inline void
ESM_clearErrorPin(void)
{
    //
    // Configure the operation mode.
    //
    HWREGB(ESMSYSTEM_BASE + ESM_SYS_O_PIN_CTRL) =
                         (HWREGB(ESMSYSTEM_BASE + ESM_SYS_O_PIN_CTRL) &
                         ~(ESM_SYS_PIN_CTRL_KEY_M)) |
                         ((uint8_t)ESM_CLEAR_EVENT << ESM_SYS_PIN_CTRL_KEY_S);
}

//*****************************************************************************
//
//! Sets the ESM error output pin mode
//!
//! \param mode indicates whether the output pin is level or PWM mode.
//!
//! This function configures the mode of the ESM error output pin. This
//! function should only be called when the ESM is disabled, from the Global
//! Enable register.
//!
//! \return None.
//
//*****************************************************************************
static inline void
ESM_setOutputPinMode(ESM_OutputPinMode mode)
{
    //
    // Configure the ESM error output pin mode
    //
    HWREG(ESMSYSTEM_BASE + ESM_SYS_O_PIN_CTRL) =
                                (HWREG(ESMSYSTEM_BASE + ESM_SYS_O_PIN_CTRL) &
                                ~(ESM_SYS_PIN_CTRL_PWM_EN_M)) |
                                ((uint32_t)mode << ESM_SYS_PIN_CTRL_PWM_EN_S);
}

//*****************************************************************************
//
//! Sets the polarity of the Error pin in Level mode.
//!
//! \param polarity indicates whether the polarity is active low or active high
//!
//! This function sets the Level mode polarity. When the error output pin is a
//! level, by default it is active low (drives the error pin low to indicate
//! an error). When 4’b1111 is written to this field, the polarity will be
//! active high instead.
//!
//! The polarity should only be modified when the ESM is disabled, from the
//! Global Enable register.
//!
//! \return None.
//
//*****************************************************************************
static inline void
ESM_setLevelModePolarity(ESM_LevelModePolarity polarity)
{
    //
    // Set the polarity of the Level mode
    //
    HWREG(ESMSYSTEM_BASE + ESM_SYS_O_PIN_CTRL) =
                        (HWREG(ESMSYSTEM_BASE + ESM_SYS_O_PIN_CTRL) &
                        ~(ESM_SYS_PIN_CTRL_POLARITY_M)) |
                        ((uint32_t)polarity << ESM_SYS_PIN_CTRL_POLARITY_S);
}

//*****************************************************************************
//
//! Get the current state of the Error pin output.
//!
//! This function returns the status of the Error Pin as looped back from the
//! I/O.
//!
//! \return Returns \b true if De-Asserted (pin is inactive, high).
//!         Returns \b false if Asserted (pin is active, low).
//
//*****************************************************************************
static inline bool
ESM_getErrorPinStatus(void)
{
    //
    // Return the status of the Error pin.
    //
    return(HWREGB(ESMSYSTEM_BASE + ESM_SYS_O_PIN_STS) == ESM_SYS_PIN_STS_VAL);
}

//*****************************************************************************
//
//! Enables High priority Watchdog feature.
//!
//! \param base is the base address of the ESM CPU instance.
//!
//! This function enables the high priority Watchdog and its associated
//! interrupt.
//!
//! \return None.
//
//*****************************************************************************
static inline void
ESM_enableHighPriorityWatchdog(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(ESM_isBaseValid(base) && (base != ESMSYSTEM_BASE));

    //
    // Enable the high priority watchdog
    //
    HWREGB(base + ESM_CPU_O_HI_PRI_WD_CFG) = ESM_WATCHDOG_ENABLE;
}

//*****************************************************************************
//
//! Disables the High priority Watchdog feature.
//!
//! \param base is the base address of the ESM CPU instance.
//!
//! This function disables the high priority Watchdog and its associated
//! interrupt.
//!
//! \return None.
//
//*****************************************************************************
static inline void
ESM_disableHighPriorityWatchdog(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(ESM_isBaseValid(base) && (base != ESMSYSTEM_BASE));

    //
    // Disable the high priority watchdog
    //
    HWREGB(base + ESM_CPU_O_HI_PRI_WD_CFG) = ESM_WATCHDOG_DISABLE;
}

//*****************************************************************************
//
//! Enables High priority Watchdog's Free running mode.
//!
//! \param base is the base address of the ESM CPU instance.
//!
//! This function enables the high priority Watchdog free running mode. If it
//! is enabled, the Watchdog counter will continue to count down during debug.
//!
//! \return None.
//
//*****************************************************************************
static inline void
ESM_enableHighPriorityWatchdogFreerun(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(ESM_isBaseValid(base) && (base != ESMSYSTEM_BASE));

    //
    // Enable the high priority watchdog
    //
    HWREGH(base + ESM_CPU_O_HI_PRI_WD_CFG) =
                    (HWREGH(base + ESM_CPU_O_HI_PRI_WD_CFG) &
                    ~(ESM_CPU_HI_PRI_WD_CFG_EMU_FREE_M)) |
                    ((uint16_t)ESM_WATCHDOG_ENABLE <<
                    ESM_CPU_HI_PRI_WD_CFG_EMU_FREE_S);
}

//*****************************************************************************
//
//! Disables High priority Watchdog's Free running mode.
//!
//! \param base is the base address of the ESM CPU instance.
//!
//! This function disables the high priority Watchdog free running mode. The
//! watchdog counter will be frozen during debug and not resume counting down
//! until debug is suspended.
//!
//! \return None.
//
//*****************************************************************************
static inline void
ESM_disableHighPriorityWatchdogFreerun(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(ESM_isBaseValid(base) && (base != ESMSYSTEM_BASE));

    //
    // Enable the high priority watchdog
    //
    HWREGH(base + ESM_CPU_O_HI_PRI_WD_CFG) =
                    (HWREGH(base + ESM_CPU_O_HI_PRI_WD_CFG) &
                    ~(ESM_CPU_HI_PRI_WD_CFG_EMU_FREE_M)) |
                    ((uint16_t)ESM_WATCHDOG_DISABLE <<
                    ESM_CPU_HI_PRI_WD_CFG_EMU_FREE_S);
}

//*****************************************************************************
//
//! Enables the Error pin monitor.
//!
//! This function enables the Error Pin Monitor and its associated interrupt.
//!
//! \return None.
//
//*****************************************************************************
static inline void
ESM_enableErrorPinMonitor(void)
{
    //
    // Enable the Error pin monitor.
    //
    HWREGB(ESMSYSTEM_BASE + ESM_SYS_O_ERRPIN_MON_CFG) =
                                                ESM_ERROR_PIN_MONITOR_ENABLE;
}

//*****************************************************************************
//
//! Disables the Error pin monitor.
//!
//! This function disables the Error Pin Monitor and its associated interrupt.
//!
//! \return None.
//
//*****************************************************************************
static inline void
ESM_disableErrorPinMonitor(void)
{
    //
    // Disable the Error pin monitor.
    //
    HWREGB(ESMSYSTEM_BASE + ESM_SYS_O_ERRPIN_MON_CFG) =
                                            ESM_ERROR_PIN_MONITOR_DISABLE;
}

//*****************************************************************************
//
//! Set the Error pin monitor interrupt.
//!
//! This function allows software to set the Error pin monitor interrupt
//! output.
//!
//! \return None.
//
//*****************************************************************************
static inline void
ESM_setErrorPinMonitorInterrupt(void)
{
    //
    // Set the Error pin monitor interrupt.
    //
    HWREGB(ESMSYSTEM_BASE + ESM_SYS_O_ERRPIN_MON_INTR_SET) =
                                            ESM_SYS_ERRPIN_MON_INTR_SET_VAL;
}

//*****************************************************************************
//
//! Clear the Error pin monitor interrupt.
//!
//! This function allows software to clear the Error pin monitor interrupt
//! output.
//!
//! \return None.
//
//*****************************************************************************
static inline void
ESM_clearErrorPinMonitorInterrupt(void)
{
    //
    // Clear the Error pin monitor interrupt.
    //
    HWREGB(ESMSYSTEM_BASE + ESM_SYS_O_ERRPIN_MON_INTR_CLR) =
                                            ESM_SYS_ERRPIN_MON_INTR_CLR_VAL;
}

//*****************************************************************************
//
//! Get the Error pin monitor interrupt status.
//!
//! This function returns the status of the Error pin monitor interrupt
//!
//! \return Returns \b true if Inactive or Disabled
//!         Returns \b false if Active/Pending and Enabled
//
//*****************************************************************************
static inline bool
ESM_getErrorPinMonitorInterruptStatus(void)
{
    //
    // Get the Error pin monitor interrupt status
    //
    return(HWREGB(ESMSYSTEM_BASE + ESM_SYS_O_ERRPIN_MON_INTR_SET) != 0U);
}

//*****************************************************************************
//
//! Enable interrupt for an event
//!
//! \param base is the base address of the ESM module instance.
//! \param event is the error event.
//!      Refer ESM_EventMap for the list of error inputs to the ESM subsystem.
//!
//! The function sets the interrupt enable bit for the specific error event.
//! If the corresponding bit and the global_enable are set, then then
//! interrupt is unmasked.
//! The enable field is only reset by a Power-On-Reset (not warm reset) or
//! global soft reset.
//!
//! \return None.
//
//*****************************************************************************
static inline void
ESM_enableInterrupt(uint32_t base, ESM_EventMap event)
{
    //
    // Check the arguments.
    //
    ASSERT(ESM_isBaseValid(base));

    //
    // Calculate the group number & event number from the global event number.
    //
    uint32_t groupNum = (uint32_t)event / 32U;
    uint32_t eventNum = (uint32_t)event % 32U;

    //
    // Set the Interrupt enable bit
    //
    HWREG(base + ESM_CPU_O_INTR_EN_SET(groupNum)) = (uint32_t)1U << eventNum;
}

//*****************************************************************************
//
//! Disable interrupt for an event
//!
//! \param base is the base address of the ESM module instance.
//! \param event is the error event.
//!      Refer ESM_EventMap for the list of error inputs to the ESM subsystem.
//!
//! The function clears the interrupt enable bit for the specific error event.
//! (The interrupt is disabled.)
//!
//! \return None.
//
//*****************************************************************************
static inline void
ESM_disableInterrupt(uint32_t base, ESM_EventMap event)
{
    //
    // Check the arguments.
    //
    ASSERT(ESM_isBaseValid(base));

    //
    // Calculate the group number & event number from the global event number.
    //
    uint32_t groupNum = (uint32_t)event / 32U;
    uint32_t eventNum = (uint32_t)event % 32U;

    //
    // Set the Interrupt enable bit
    //
    HWREG(base + ESM_CPU_O_INTR_EN_CLR(groupNum)) = (uint32_t)1U << eventNum;
}

//*****************************************************************************
//
//! Sets the Interrupt priority level.
//!
//! \param base is the base address of the ESM instance.
//! \param event is the error event.
//!      Refer ESM_EventMap for the list of error inputs to the ESM subsystem.
//! \param priority indicates the priority level of the interrupt.
//!                 Refer enum ESM_InterruptPriorityLevel
//!
//! This function sets which interrupt (low or high prirority) should be
//! influenced for the events in group N.
//!
//! \return None
//
//*****************************************************************************
static inline void
ESM_setInterruptPriorityLevel(uint32_t base, ESM_EventMap event,
                            ESM_InterruptPriorityLevel priority)
{
    //
    // Check the arguments.
    //
    ASSERT(ESM_isBaseValid(base) && (base != ESMSYSTEM_BASE));

    //
    // Calculate the group number & event number from the global event number.
    //
    uint32_t groupNum = (uint32_t)event / 32U;
    uint32_t eventNum = (uint32_t)event % 32U;

    //
    // Set the interrupt priority level for the event
    //
    if(priority == ESM_INTERRUPT_PRIORITY_LEVEL_HIGH)
    {
        HWREG(base + ESM_CPU_O_INT_PRIO(groupNum)) |= 1U << eventNum;
    }
    else
    {
        HWREG(base + ESM_CPU_O_INT_PRIO(groupNum)) &= ~(1U << eventNum);
    }
}

//*****************************************************************************
//
//! Set the interrupt raw status of an event.
//!
//! \param base is the base address of the ESM instance.
//! \param event is the error event.
//!      Refer ESM_EventMap for the list of error inputs to the ESM subsystem.
//!
//! This function sets the interrupt raw status for the corresponding error
//! event.
//!
//
//*****************************************************************************
static inline void
ESM_setRawInterruptStatus(uint32_t base, ESM_EventMap event)
{
    //
    // Check the arguments.
    //
    ASSERT(ESM_isBaseValid(base));

    //
    // Calculate the group number & event number from the global event number.
    //
    uint32_t groupNum = (uint32_t)event / 32U;
    uint32_t eventNum = (uint32_t)event % 32U;

    //
    // Get the interrupt status of the corresponding event.
    //
    HWREG(base + ESM_CPU_O_RAW(groupNum)) = (uint32_t)1U << eventNum;
}

//*****************************************************************************
//
//! Get the interrupt raw status of an event.
//!
//! \param base is the base address of the ESM instance.
//! \param event is the error event.
//!      Refer ESM_EventMap for the list of error inputs to the ESM subsystem.
//!
//! This function returns the raw status of the interrupt for the corresponding
//! error event.
//!
//! \return Returns \b false if Inactive
//!         Returns \b true if Active/Pending
//
//*****************************************************************************
static inline bool
ESM_getRawInterruptStatus(uint32_t base, ESM_EventMap event)
{
    //
    // Check the arguments.
    //
    ASSERT(ESM_isBaseValid(base));

    //
    // Calculate the group number & event number from the global event number.
    //
    uint32_t groupNum = (uint32_t)event / 32U;
    uint32_t eventNum = (uint32_t)event % 32U;

    //
    // Get the interrupt status of the corresponding event.
    //
    return(((HWREG(base + ESM_CPU_O_RAW(groupNum)) >> eventNum) & 1U) != 0U);
}

//*****************************************************************************
//
//! Get the interrupt status for an event.
//!
//! \param base is the base address of the ESM instance.
//! \param event is the error event.
//!      Refer ESM_EventMap for the list of error inputs to the ESM subsystem.
//!
//! This function returns the status of the interrupt for the corresponding
//! error event.
//!
//! \return Returns \b false if Inactive or Disabled
//!         Returns \b true if Active/Pending and Enabled
//
//*****************************************************************************
static inline bool
ESM_getInterruptStatus(uint32_t base, ESM_EventMap event)
{
    //
    // Check the arguments.
    //
    ASSERT(ESM_isBaseValid(base));

    //
    // Calculate the group number & event number from the global event number.
    //
    uint32_t groupNum = (uint32_t)event / 32U;
    uint32_t eventNum = (uint32_t)event % 32U;

    //
    // Get the interrupt status of the corresponding event.
    //
    return(((HWREG(base + ESM_CPU_O_STS(groupNum)) >> eventNum) & 1U) != 0U);
}

//*****************************************************************************
//
//! Clear the interrupt raw status of an event.
//!
//! \param base is the base address of the ESM instance.
//! \param event is the error event.
//!      Refer ESM_EventMap for the list of error inputs to the ESM subsystem.
//!
//! This function clears the interrupt raw status for the corresponding error
//! event.
//!
//
//*****************************************************************************
static inline void
ESM_clearRawInterruptStatus(uint32_t base, ESM_EventMap event)
{
    //
    // Check the arguments.
    //
    ASSERT(ESM_isBaseValid(base));

    //
    // Calculate the group number & event number from the global event number.
    //
    uint32_t groupNum = (uint32_t)event / 32U;
    uint32_t eventNum = (uint32_t)event % 32U;

    //
    // Get the interrupt status of the corresponding event.
    //
    HWREG(base + ESM_CPU_O_STS(groupNum)) = (uint32_t)1U << eventNum;
}

//*****************************************************************************
//
//! Sets Critical priority interrupt influence for an event
//!
//! \param base is the base address of the ESM module instance.
//! \param event is the error event.
//!      Refer ESM_EventMap for the list of error inputs to the ESM subsystem.
//! \param influence indicates if the event influences the critical priority
//! interrupt or not
//!
//! The function sets/clears the critical priority interrupt influence enable
//! bit for the specific error event. Corresponding event, when set, will
//! count as a pending event towards generating a critical priority interrupt.
//! It can only be reset by a Power-On-Reset (not warm reset) or global soft
//! reset. When cleared, the corresponding event will no longer count as a
//! pending event towards generating a critical priority interrupt.
//!
//! \return None.
//
//*****************************************************************************
static inline void
ESM_setCriticalPriorityInterruptInfluence(uint32_t base,
                                        ESM_EventMap event, bool influence)
{
    //
    // Check the arguments.
    //
    ASSERT(ESM_isBaseValid(base));

    //
    // Calculate the group number & event number from the global event number.
    //
    uint32_t groupNum = (uint32_t)event / 32U;
    uint32_t eventNum = (uint32_t)event % 32U;

    //
    // Set/clear the Critical Priority Interrupt Influence enable
    //
    if(influence == true)
    {
        HWREG(base + ESM_CPU_O_CRIT_EN_SET(groupNum)) = (uint32_t)1U << eventNum;
    }
    else
    {
        HWREG(base + ESM_CPU_O_CRIT_EN_CLR(groupNum)) = (uint32_t)1U << eventNum;
    }
}

//*****************************************************************************
//
//! Get Critical priority interrupt output status
//!
//! \param base is the base address of the ESM module instance.
//!
//! The function returns the status of the critical priority interrupt output.
//! The status is only reset via POR and the Global Soft Reset MMR.
//!
//! \return Returns \b true if the Critical Priority Interrupt output has
//! triggered, returns \b false otherwise.
//
//*****************************************************************************
static inline bool
ESM_getCriticalPriorityInterruptStatus(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(ESM_isBaseValid(base));

