TexasInstruments/f29h85x-sdk/source/driverlib/esm.h
    return((HWREG(base + ESM_CPU_O_INFO) & ESM_CPU_INFO_CRIT_INTR) ==
                                                     ESM_CPU_INFO_CRIT_INTR);
}

//*****************************************************************************
//
//! Sets the influence of an event on the Error pin
//!
//! \param event is the error event.
//!      Refer ESM_EventMap for the list of error inputs to the ESM subsystem.
//! \param influence indicates if the event influences the error pin or not
//!
//! This function sets if the error event in group N can influence the Error
//! pin. Corresponding event, when set, will count as a pending error event
//! for the ESM state machine. If influence is cleared, the corresponding
//! events will no longer count as pending error events.
//!
//! \return None
//
//*****************************************************************************
static inline void
ESM_setInfluenceOnErrorPin(ESM_EventMap event, bool influence)
{
    //
    // Calculate the group number & event number from the global event number.
    //
    uint32_t groupNum = (uint32_t)event / 32U;
    uint32_t eventNum = (uint32_t)event % 32U;

    if(influence == true)
    {
        HWREG(ESMSYSTEM_BASE + ESM_CPU_O_PIN_EN_SET(groupNum)) =
                                                            (uint32_t)1U << eventNum;
    }
    else
    {
        HWREG(ESMSYSTEM_BASE + ESM_CPU_O_PIN_EN_CLR(groupNum)) =
                                                            (uint32_t)1U << eventNum;
    }
}

//*****************************************************************************
//
//! Get the low priority interrupt status for an Event group.
//!
//! \param base is the base address of the ESM instance.
//! \param group is the event group.
//!     Refer ESM_EventGroup for the list of event groups in the ESM subsystem.
//!
//! This function returns the status of the low priority interrupt for the
//! corresponding error group.
//!
//! \return Returns \b true if the event Groups have one or more Low Priority
//! interrupts pending, returns \b false otherwise.
//
//*****************************************************************************
static inline bool
ESM_getLowPriorityInterruptStatus(uint32_t base, ESM_EventGroup group)
{
    //
    // Check the arguments.
    //
    ASSERT(ESM_isBaseValid(base));

    return((HWREGH(base + ESM_CPU_O_LOW) & (uint16_t)group) ==
                                                            (uint16_t)group);
}

//*****************************************************************************
//
//! Get the high priority interrupt status for an Event group.
//!
//! \param base is the base address of the ESM instance.
//! \param group is the event group.
//!     Refer ESM_EventGroup for the list of event groups in the ESM subsystem.
//!
//! This function returns the status of the high priority interrupt for the
//! corresponding error group.
//!
//! \return Returns \b true if the event Groups have one or more High Priority
//! interrupts pending, returns \b false otherwise.
//
//*****************************************************************************
static inline bool
ESM_getHighPriorityInterruptStatus(uint32_t base, ESM_EventGroup group)
{
    //
    // Check the arguments.
    //
    ASSERT(ESM_isBaseValid(base) && (base != ESMSYSTEM_BASE));

    return((HWREGH(base + ESM_CPU_O_HI) & (uint16_t)group) == (uint16_t)group);
}

//*****************************************************************************
//
//! Get the highest priority outstanding low priority interrupt.
//!
//! \param base is the base address of the ESM instance.
//!
//! This function returns the global event number of the highest priority
//! outstanding low priority interrupt that is pending. The lowest event
//! number has the highest priority. A value of 0xFFFF indicates that there
//! are no low priority interrupts pending.
//!
//! \return Returns the global event number of the highest priority outstanding
//! low priority interrupt.
//
//*****************************************************************************
static inline uint32_t
ESM_getHighestLowPriorityInterrupt(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(ESM_isBaseValid(base));

    return((HWREG(base + ESM_CPU_O_LOW_PRI) & (ESM_CPU_LOW_PRI_PLS_M)) >>
                                                    ESM_CPU_LOW_PRI_PLS_S);
}

//*****************************************************************************
//
//! Get the highest priority outstanding high priority interrupt.
//!
//! \param base is the base address of the ESM instance.
//!
//! This function returns the global event number of the highest priority
//! outstanding high priority interrupt that is pending. The lowest event
//! number has the highest priority. A value of 0xFFFF indicates that there
//! are no high priority interrupts pending.
//!
//! \return Returns the global event number of the highest priority outstanding
//! high priority interrupt.
//
//*****************************************************************************
static inline uint32_t
ESM_getHighestHighPriorityInterrupt(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(ESM_isBaseValid(base) && (base != ESMSYSTEM_BASE));

    return((HWREG(base + ESM_CPU_O_HI_PRI) & (ESM_CPU_HI_PRI_PLS_M)) >>
                                                    ESM_CPU_HI_PRI_PLS_S);
}

//*****************************************************************************
//
//! Get the Error pin counter value
//!
//! This function gets the current value of the Time Interval Counter. This
//! register is reloaded to the counter_preload value on entry to the ESM_ERROR
//! state from ESM_IDLE and counts down by one per clock cycle.  Once the
//! counter has reached 0, the Minimum Time Interval has expired.
//!
//! \return Returns the current Error pin counter value.
//
//*****************************************************************************
static inline uint32_t
ESM_getErrorPinCounterValue(void)
{
    return(HWREG(ESMSYSTEM_BASE + ESM_SYS_O_PIN_CNTR));
}

//*****************************************************************************
//
//! Lock the Error Group N Interrupt configuration Registers.
//!
//! \param base is the base address of the ESM instance.
//! \param groups Error groups whose configuration for the associated
//! Interrupt Enable Set/Clear Registers and Interrupt Priority Register are
//! to be locked. This parameter can be an OR of the groups in ESM_EventGroup
//! enum.
//!
//! This function locks the associated enable and priority bits for each Group
//! for Low and High Priority Interrupts.
//!
//! \return None
//
//*****************************************************************************
static inline void
ESM_lockErrorGroupInterruptConfig(uint32_t base, uint32_t groups)
{
    //
    // Check the arguments.
    //
    ASSERT(ESM_isBaseValid(base));

    //
    // Set the lock bit for the specified groups.
    //
    HWREG(base + ESM_CPU_O_GROUP_N_LOCK) |= groups;
}

//*****************************************************************************
//
//! Unlock the Error Group N Interrupt configuration Registers.
//!
//! \param base is the base address of the ESM instance.
//! \param groups Error groups whose configuration for the associated
//! Interrupt Enable Set/Clear Registers and Interrupt Priority Register are to
//! be unlocked.
//!
//! This function unlocks the associated enable and priority bits for each
//! Group for Low and High Priority Interrupts.
//!
//! \return None
//
//*****************************************************************************
static inline void
ESM_unlockErrorGroupInterruptConfig(uint32_t base, uint32_t groups)
{
    //
    // Check the arguments.
    //
    ASSERT(ESM_isBaseValid(base));

    //
    // Clear the lock bit for the specified groups to unlock.
    //
    HWREG(base + ESM_CPU_O_GROUP_N_LOCK) &= ~groups;
}

//*****************************************************************************
//
//! Commit the Error Group N Interrupt configuration Registers.
//!
//! \param base is the base address of the ESM instance.
//! \param groups Error groups whose lock on configuration for the associated
//! Interrupt Enable Set/Clear Registers and Interrupt Priority Register are to
//! be committed.
//!
//! This function locks the associated enable and priority bits for each Group
//! for Low and High Priority Interrupts.
//!
//! \return None
//
//*****************************************************************************
static inline void
ESM_commitErrorGroupInterruptConfig(uint32_t base, uint32_t groups)
{
    //
    // Check the arguments.
    //
    ASSERT(ESM_isBaseValid(base));

    //
    // Set the commit bit for the specified groups.
    //
    HWREG(base + ESM_CPU_O_GROUP_N_COMMIT) |= groups;
}

//*****************************************************************************
//
//! Lock Error Pin Influence registers
//!
//! \param groups Error groups whose Error Pin Influence Set and Clear
//! Registers are to be locked.
//!
//! This function locks the Error Pin Influence configuration for the
//! associated Error Groups.
//!
//! \return None
//
//*****************************************************************************
static inline void
ESM_lockErrorPinInfluenceConfig(uint32_t groups)
{
    HWREG(ESMSYSTEM_BASE + ESM_SYS_O_ERR_PIN_INFLUENCE_LOCK) |= groups;
}

//*****************************************************************************
//
//! Unlock the Error Pin Influence registers
//!
//! \param groups Error groups whose Error Pin Influence Set and Clear
//! Registers are to be unlocked.
//!
//! This function unlocks the Error Pin Influence configuration for the
//! associated Error Groups, if the corresponding Commit bit is not set.
//!
//! \return None
//
//*****************************************************************************
static inline void
ESM_unlockErrorPinInfluenceConfig(uint32_t groups)
{
    HWREG(ESMSYSTEM_BASE + ESM_SYS_O_ERR_PIN_INFLUENCE_LOCK) &= ~groups;
}

//*****************************************************************************
//
//! Commit the Error Pin Influence registers
//!
//! \param groups Error groups whose lock on Error Pin Influence Set and Clear
//! Registers are to be committed.
//!
//! This function commits the lock configuration for the Error Pin Influence
//! configuration for the associated Error Groups.
//!
//! \return None
//
//*****************************************************************************
static inline void
ESM_commitErrorPinInfluenceConfig(uint32_t groups)
{
    HWREG(ESMSYSTEM_BASE + ESM_SYS_O_ERR_PIN_INFLUENCE_COMMIT) |= groups;
}

//*****************************************************************************
//
//! Lock the Critical Priority Interrupt Influence configuration.
//!
//! \param groups Error groups whose Error Pin Influence Set and Clear
//! Registers are to be locked.
//!
//! This function locks the Critical Priority Interrupt Influence configuration
//! for the associated Error Groups. Each bit lock[N] bit will lock the
//! associated masking MMRs associated with Group N.
//!
//! \return None
//
//*****************************************************************************
static inline void
ESM_lockCriticalPriorityInterruptInfluenceConfig(uint32_t base,
                                                 uint32_t groups)
{
    //
    // Check the arguments.
    //
    ASSERT(ESM_isBaseValid(base));

    HWREG(base + ESM_CPU_O_CRI_PRI_INFLUENCE_LOCK) |= groups;
}

//*****************************************************************************
//
//! Unlock the Critical Priority Interrupt Influence configuration.
//!
//! \param groups Error groups whose Error Pin Influence Set and Clear
//! Registers are to be unlocked.
//!
//! This function unlocks the Critical Priority Interrupt Influence
//! configuration for the associated Error Groups, if the corresponding Commit
//! bit is not set.
//!
//! \return None
//
//*****************************************************************************
static inline void
ESM_unlockCriticalPriorityInterruptInfluenceConfig(uint32_t base,
                                                   uint32_t groups)
{
    //
    // Check the arguments.
    //
    ASSERT(ESM_isBaseValid(base));

    HWREG(base + ESM_CPU_O_CRI_PRI_INFLUENCE_LOCK) &= ~groups;
}

//*****************************************************************************
//
//! Commit the Critical Priority Interrupt Influence configuration.
//!
//! \param groups Error groups whose lock on Error Pin Influence Set and Clear
//! Registers are to be committed.
//!
//! This function commits the lock configuration for the Critical Priority
//! Interrupt Influence configuration for the associated Error Groups. Each
//! bit commit[N] bit will commit the lock configuration for the corresponding
//! bit in the Critical Priority Interrupt Influence Lock Register.
//!
//! \return None
//
//*****************************************************************************
static inline void
ESM_commitCriticalPriorityInterruptInfluenceConfig(uint32_t base,
                                                   uint32_t groups)
{
    //
    // Check the arguments.
    //
    ASSERT(ESM_isBaseValid(base));

    HWREG(base + ESM_CPU_O_CRI_PRI_INFLUENCE_COMMIT) |= groups;
}

//*****************************************************************************
//
//! Lock MMR registers
//!
//! \param registers Registers to be locked. Can be OR of the following -
//!                     - ESM_GLOBAL_EN_REG
//!                     - ESM_GLOBAL_SOFT_RESET_REG
//!                     - ESM_ERROR_PIN_REG
//!                     - ESM_ERROR_PIN_MONITOR_REG
//!                     - ESM_HIGH_PRIORITY_WATCHDOG_REG
//!
//! \return None
//
//*****************************************************************************
static inline void
ESM_lockMMRConfig(uint32_t base, uint32_t registers)
{
    //
    // Check the arguments.
    //
    ASSERT(ESM_isBaseValid(base));

    HWREG(base + ESM_CPU_O_MMR_CONFIG_LOCK) |= registers;
}

//*****************************************************************************
//
//! Unlock the Configuration MMR registers
//!
//! \param registers Registers to be unlocked. Can be OR of the following -
//!                     - ESM_GLOBAL_EN_REG
//!                     - ESM_GLOBAL_SOFT_RESET_REG
//!                     - ESM_ERROR_PIN_REG
//!                     - ESM_ERROR_PIN_MONITOR_REG
//!                     - ESM_HIGH_PRIORITY_WATCHDOG_REG
//!
//! \return None
//
//*****************************************************************************
static inline void
ESM_unlockMMRConfig(uint32_t base, uint32_t registers)
{
    //
    // Check the arguments.
    //
    ASSERT(ESM_isBaseValid(base));

    HWREG(base + ESM_CPU_O_MMR_CONFIG_LOCK) &= ~registers;
}

//*****************************************************************************
//
//! Commit the configuration MMR registers
//!
//! \param registers Register locks to be committed. Can be OR of the following
//!                     - ESM_GLOBAL_EN_REG
//!                     - ESM_GLOBAL_SOFT_RESET_REG
//!                     - ESM_ERROR_PIN_REG
//!                     - ESM_ERROR_PIN_MONITOR_REG
//!                     - ESM_HIGH_PRIORITY_WATCHDOG_REG
//!
//! \return None
//
//*****************************************************************************
static inline void
ESM_commitMMRConfig(uint32_t base, uint32_t registers)
{
    //
    // Check the arguments.
    //
    ASSERT(ESM_isBaseValid(base));

    HWREG(base + ESM_CPU_O_MMR_CONFIG_COMMIT) |= registers;
}

//*****************************************************************************
//
//! Get the ESM group interrupt status
//!
//! \param group The group id for which the interrupt status is returned
//!
//! \return Group interrupt status
//
//*****************************************************************************
static inline uint32_t
ESM_getGroupRawIntStatus(uint32_t base, uint32_t group)
{
    //
    // Check the arguments.
    //
    ASSERT(ESM_isBaseValid(base));

    return (HWREG(base + ESM_CPU_O_RAW(group)));
}

//*****************************************************************************
//
//! Clear the group interrupt status
//!
//! \param group Group for which the interrupt status is cleared
//!
//! \return None
//
//*****************************************************************************
static inline void
ESM_clearGroupIntStatus(uint32_t base, uint32_t group)
{
    //
    // Check the arguments.
    //
    ASSERT(ESM_isBaseValid(base));

    HWREG(base + ESM_CPU_O_STS(group)) = 0xFFFFFFFFU;
}

//*****************************************************************************
//
//! Configure the ESM action for a error event
//!
//! \param base is the base address of the ESM instance.
//! \param event is the ESM Error event which is configured.
//! \param configType is the configuration - low priority interrupt, NMI,
//! Critical priority interrupt or Error pin output.
//!
//! This function configures the settings for the specific error event
//! according to the configType specified.
//!
//! \return None.
//
//*****************************************************************************
extern void
ESM_config(uint32_t base, ESM_EventMap event, ESM_ConfigType configType);

//*****************************************************************************
//
//! Configure the ESM error event
//!
//! \param base is the base address of the ESM instance.
//! \param configparams is the configuration parameters used to configure the
//! error event.
//!
//! This function configures the settings for the specific error event. It sets
//! the priority level and configures the influence on the critical priority
//! event and error pin.
//!
//! \return None.
//
//*****************************************************************************
extern void
ESM_configErrorEvent(uint32_t base, const ESM_ConfigParams *configParams);

//*****************************************************************************
//
//! Set the High Priority Watchdog counter pre-load value
//!
//! \param base is the base address of the ESM instance.
//! \param value is the preload value for the watchdog counter.
//!
//! This function sets the pre-load register with the watchdog counter value.
//! This is the value that will be loaded in to the counter field of the High
//! Priority Watchdog Counter Register.
//!
//! \return None.
//
//*****************************************************************************
extern void
ESM_setWatchdogCounterPreload(uint32_t base, uint32_t value);

//*****************************************************************************
//
//! Set the Error pin counter pre-load value
//!
//! \param value is the preload value for the Error pin counter.
//!
//! This function sets the pre-load register with the Error pin counter. This
//! is the value that will be loaded in to the counter field of the Pin
//! Counter Value Register.
//!
//! \return None.
//
//*****************************************************************************
extern void
ESM_setErrorPinCounterPreload(uint32_t value);

//*****************************************************************************
//
//! Set the PWM high and low counter preload value.
//!
//! \param highValue is the PWM high counter preload value.
//! \param lowValue is the PWM low counter preload value.
//!
//! This functions sets the counter preload value. This value will be loaded
//! in to the counter field of the Error Pin PWM High Counter Value Register
//! and Low counter value register respectively, whenever the error output
//! pin toggles high.
//!
//! \return None.
//
//*****************************************************************************
extern void
ESM_setPWMCounterPreload(uint32_t highValue, uint32_t lowValue);

//*****************************************************************************
//
//! Configure the ESM Error Pin
//!
//! \param configparams is the configuration parameters used to configure the
//! error pin.
//!
//! This function configures the settings for the output Error pin.
//!
//! \return None.
//
//*****************************************************************************
extern void
ESM_configErrorPin(const ESM_ErrorPinConfigParams *configParams);


//*****************************************************************************
//
//! Configure Serial VBUS read
//!
//! \param inst is the ESM instance.
//! \param readAddress is the address to be set for Serial VBUS read.
//!
//! This function configures the Serial VBUS read at the \e readAddress
//! specified, for the ESM instance corresponding to \e inst.
//!
//! \return None.
//
//*****************************************************************************
static inline void
ESM_configSvbusRead(ESM_Instance inst, uint8_t readAddress)
{

