TexasInstruments/f29h85x-sdk/source/driverlib/esm.h
    HWREG(ESMSAFETYAGG_BASE + ESM_SAFETY_AGGREGATOR_O_ECC_VECTOR) =
         (uint32_t)inst | ESM_SAFETY_AGGREGATOR_ECC_VECTOR_RD_SVBUS |
         ((uint32_t)readAddress <<
                    ESM_SAFETY_AGGREGATOR_ECC_VECTOR_RD_SVBUS_ADDRESS_S);
}

//*****************************************************************************
//
//! Trigger Serial VBUS read
//!
//! This function triggers a read on the serial VBUS.
//!
//! \return None.
//
//*****************************************************************************
static inline void
ESM_triggerSvbusRead(void)
{
    HWREG(ESMSAFETYAGG_BASE + ESM_SAFETY_AGGREGATOR_O_ECC_VECTOR) |=
                                ESM_SAFETY_AGGREGATOR_ECC_VECTOR_RD_SVBUS;
}

//*****************************************************************************
//
//! Get the Serial VBUS Read Address.
//!
//! This function returns the read address of the Serial VBUS.
//!
//! \return Returns the SVBUS read address.
//
//*****************************************************************************
static inline uint32_t
ESM_getSvbusReadAddress(void)
{
    return((HWREG(ESMSAFETYAGG_BASE + ESM_SAFETY_AGGREGATOR_O_ECC_VECTOR)
            & (uint32_t)ESM_SAFETY_AGGREGATOR_ECC_VECTOR_RD_SVBUS_ADDRESS_M)
            >> ESM_SAFETY_AGGREGATOR_ECC_VECTOR_RD_SVBUS_ADDRESS_S);
}

//*****************************************************************************
//
//! Get the serial VBUS read status.
//!
//! This function returns the status if the read operation on the serial VBUS
//! is complete.
//!
//! \return Returns \b true if serial VBUS read is complete.
//!         Returns \b false if serial VBUS read is not complete.
//
//*****************************************************************************
static inline bool
ESM_getSvbusReadStatus(void)
{
    return((HWREG(ESMSAFETYAGG_BASE + ESM_SAFETY_AGGREGATOR_O_ECC_VECTOR)
                    & ESM_SAFETY_AGGREGATOR_ECC_VECTOR_RD_SVBUS_DONE) ==
                    ESM_SAFETY_AGGREGATOR_ECC_VECTOR_RD_SVBUS_DONE);
}

//*****************************************************************************
//
//! Clear serial VBUS read status
//!
//! This function clears the status of the read operation on the serial VBUS.
//!
//! \return None.
//
//*****************************************************************************
static inline void
ESM_clearSvbusReadStatus(void)
{
    HWREG(ESMSAFETYAGG_BASE + ESM_SAFETY_AGGREGATOR_O_ECC_VECTOR) &=
                    ~(uint32_t)ESM_SAFETY_AGGREGATOR_ECC_VECTOR_RD_SVBUS_DONE;
}

//*****************************************************************************
//
//! Set EOI
//!
//! This function sets the End Of Interrupt for DED.
//!
//! \return None.
//
//*****************************************************************************
static inline void
ESM_ackDedInterrupt(void)
{
    HWREG(ESMSAFETYAGG_BASE + ESM_SAFETY_AGGREGATOR_O_DED_EOI_REG) =
                                    ESM_SAFETY_AGGREGATOR_DED_EOI_REG_EOI_WR;
}

//*****************************************************************************
//
//! Get the Safety Aggregator Interrupt pending status.
//!
//! \param inst is the ESM instance to enable the interrupt for.
//!
//! This function returns the pending status of the interrupt from the EDC
//! controller for the ESM instance specified.
//!
//! \return Returns \b true if there are pending interrupts.
//!         Returns \b false if there are no pending interrupts.
//
//*****************************************************************************
static inline bool
ESM_getInterruptPendingStatus(ESM_Instance inst)
{
    return((HWREGB(ESMSAFETYAGG_BASE + ESM_SAFETY_AGGREGATOR_O_DED_STATUS_REG0)
            & (uint8_t)inst) == (uint8_t)inst);
}

//*****************************************************************************
//
//! Enable EDC Controller Interrupt
//!
//! \param inst is the ESM instance to enable the interrupt for.
//!
//! This function enables the interrupt for the EDC controller of the
//! specified ESM instance.
//!
//! \return None.
//
//*****************************************************************************
static inline void
ESM_enableEdcInterrupt(ESM_Instance inst)
{
    HWREGB(ESMSAFETYAGG_BASE + ESM_SAFETY_AGGREGATOR_O_DED_ENABLE_SET_REG0)
                                                        |= (uint8_t)inst;
}

//*****************************************************************************
//
//! Disable EDC Controller Interrupt
//!
//! \param inst is the ESM instance to disable the interrupt for.
//!
//! This function disables the interrupt for the EDC controller of the
//! specified ESM instance.
//!
//! \return None.
//
//*****************************************************************************
static inline void
ESM_disableEdcInterrupt(ESM_Instance inst)
{
    HWREGB(ESMSAFETYAGG_BASE + ESM_SAFETY_AGGREGATOR_O_DED_ENABLE_CLR_REG0)
                                                        |= (uint8_t)inst;
}

//*****************************************************************************
//
//! Enable Safety Aggregator Error Interrupt
//!
//! \param errorType is the type of the aggregator error.
//!
//! This function enables the interrupt for the safety aggregator error
//! specified by the \e errorType parameter.
//!
//! \return None.
//
//*****************************************************************************
static inline void
ESM_enableAggrErrorInterrupt(ESM_AggrErrorType errorType)
{
    HWREGB(ESMSAFETYAGG_BASE + ESM_SAFETY_AGGREGATOR_O_AGGR_ENABLE_SET)
                                                 |= 1U << (uint8_t)errorType;
}

//*****************************************************************************
//
//! Disable Safety Aggregator Error Interrupt
//!
//! \param errorType is the type of the aggregator error.
//!
//! This function disables the interrupt for the safety aggregator error
//! specified by the \e errorType parameter.
//!
//! \return None.
//
//*****************************************************************************
static inline void
ESM_disableAggrErrorInterrupt(ESM_AggrErrorType errorType)
{
    HWREGB(ESMSAFETYAGG_BASE + ESM_SAFETY_AGGREGATOR_O_AGGR_ENABLE_CLR)
                                                 |= 1U << (uint8_t)errorType;
}

//*****************************************************************************
//
//! Force the Aggregator Error Interrupt
//!
//! \param errorType is the type of the aggregator error.
//!
//! This function forces the error interrupt for the aggregator error specified
//! by the \e errorType parameter.
//! A single force (write of 1) increments the count of errors.
//!
//! \return None.
//
//*****************************************************************************
static inline void
ESM_forceAggrErrorInterrupt(ESM_AggrErrorType errorType)
{
    HWREGB(ESMSAFETYAGG_BASE + ESM_SAFETY_AGGREGATOR_O_AGGR_STATUS_SET) =
      HWREGB(ESMSAFETYAGG_BASE + ESM_SAFETY_AGGREGATOR_O_AGGR_STATUS_SET)
      & (~(ESM_SAFETY_AGGREGATOR_AGGR_STATUS_SET_PARITY_M <<
        (ESM_SAFETY_AGGREGATOR_AGGR_STATUS_SET_TIMEOUT_S * (uint8_t)errorType)))
      | (1U << (ESM_SAFETY_AGGREGATOR_AGGR_STATUS_SET_TIMEOUT_S *
        (uint8_t)errorType));
}

//*****************************************************************************
//
//! Get the Aggregator Error Interrupt Status
//!
//! \param errorType is the type of the aggregator error.
//!
//! This function returns the status of the error interrupt specified by the
//! \e errorType parameter. It reflects the number of times the correspoding
//! error has occurred.
//!
//! \return Returns the interrupt status.
//
//*****************************************************************************
static inline uint8_t
ESM_getAggrErrorInterruptStatus(ESM_AggrErrorType errorType)
{
    return((HWREGB(ESMSAFETYAGG_BASE + ESM_SAFETY_AGGREGATOR_O_AGGR_STATUS_SET)
            & (ESM_SAFETY_AGGREGATOR_AGGR_STATUS_SET_PARITY_M <<
      (ESM_SAFETY_AGGREGATOR_AGGR_STATUS_SET_TIMEOUT_S * (uint8_t)errorType)))
    >> (ESM_SAFETY_AGGREGATOR_AGGR_STATUS_SET_TIMEOUT_S * (uint8_t)errorType));
}

//*****************************************************************************
//
//! Clear the Aggregator Error Interrupt
//!
//! \param errorType is the type of the aggregator error.
//!
//! This function clears the error interrupt for the aggregator error specified
//! by the \e errorType parameter.
//! A single clear (write of 1) decrements the count of errors.
//!
//! \return None.
//
//*****************************************************************************
static inline void
ESM_clearAggrErrorInterruptStatus(ESM_AggrErrorType errorType)
{
    HWREGB(ESMSAFETYAGG_BASE + ESM_SAFETY_AGGREGATOR_O_AGGR_STATUS_CLR) =
      HWREGB(ESMSAFETYAGG_BASE + ESM_SAFETY_AGGREGATOR_O_AGGR_STATUS_CLR)
      & (~(ESM_SAFETY_AGGREGATOR_AGGR_STATUS_SET_PARITY_M <<
        (ESM_SAFETY_AGGREGATOR_AGGR_STATUS_SET_TIMEOUT_S * (uint8_t)errorType)))
      | (1U << (ESM_SAFETY_AGGREGATOR_AGGR_STATUS_SET_TIMEOUT_S *
        (uint8_t)errorType));
}


//*****************************************************************************
//
// Close the Doxygen group.
//! @}
//
//*****************************************************************************



//*****************************************************************************
//
// Mark the end of the C bindings section for C++ compilers.
//
//*****************************************************************************
#ifdef __cplusplus
}
#endif

#endif // ESM_H